Loadtest/gateway.yaml
config:
  target: 'https://4e83-82-174-102-236.ngrok-free.app/api'
  phases:
    - duration: 60
      arrivalRate: 30
  ensure:
    maxErrorRate: 1
    max: 500
  defaults:
    headers:
      Content-Type: application/json
    http:
      timeout: 10000
 
scenarios:
  - name: 'Get a list of posts'
    flow:
      - get:
          url: '/posts'
          expect:
            - statusCode: 200