Loadtest/gateway.yaml
config:
  target: 'http://192.168.144.150:8080/api'
  phases:
    - duration: 30
      arrivalRate: 5
  ensure:
    maxErrorRate: 1
    max: 500
  defaults:
    headers:
      Content-Type: application/json
    http:
      timeout: 10000
scenarios:
  - name: 'Get a list of posts'
    flow:
      - get:
          url: '/posts'
          expect:
            - statusCode: 200