Loadtest/gateway.yaml
config:
  target: 'https://desktop-gp441j7.tail79a24.ts.net/api'
  http:
    timeout: 10000
  phases:
    - duration: 60
      arrivalRate: 30
  ensure:
    maxErrorRate: 1
    max: 500
 
scenarios:
  - name: 'Get a list of posts'
    flow:
      - get:
          url: '/posts'
          expect:
            - statusCode: 200