Loadtest/gateway.yaml
config:
  target: 'http://127.0.0.1:52568/api'
  phases:
    - duration: 20
      arrivalRate: 20
  ensure:
    maxErrorRate: 1
    max: 500
 
scenarios:
  - name: 'Get a list of posts'
    flow:
      - get:
          url: '/posts'
          expect:
            - statusCode: 200
  - name: 'Get a single post'
    flow:
      - get:
          url: '/posts/5'
          expect:
            - statusCode: 200