Loadtest/gateway.yaml
config:
  target: 'http://192.168.144.150:8080/api'
  phases:
    - duration: 30
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 40
      name: Ramp up load
    - duration: 30
      arrivalRate: 40
      rampTo: 75
      name: Spike phase
  ensure:
    maxErrorRate: 1
    max: 500
  defaults:
    headers:
      Content-Type: application/json
    http:
      timeout: 10000
scenarios:
  - name: 'Get a list of posts'
    flow:
      - get:
          url: '/posts'
          expect:
            - statusCode: 200